/* Задача 40:
Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать 
треугольник с сторонами такой длины.
Теорема о неравенстве треугольника: каждая сторона треугольника меньше суммы двух других сторон. */


/* Задача 45:
Напишите программу, которая будет создавать копию заданного массива с помощью поэлементного
копирования. */


int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
int c = int.Parse(Console.ReadLine());

bool isTriangle(int a, int b, int c)
{
   return a+b>c && a+c>b && b+c>a;
}

if (isTriangle(a, b, c))
{
    Console.WriteLine("Треугольник существует");
}
else 
{
    Console.WriteLine("Треугольник не существует");
}
