// Напишите программу, которая возводит в квадрат


System.Console.WriteLine("Enter number : ");
string enterNum = Console.ReadLine();
int num = Convert.ToInt32(enterNum);

int sqr = num * num;

Console.WriteLine($"Sqr = {sqr} ");