/* Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.
Например, задан массив:
1 4 7 2
5 9 2 3
8 4 2 4

Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3. */


int[,] array = new int[3, 3] { { 1, 2, 7 }, { 3, 5, 7 }, { 5, 8, 7 } };

for (int i = 0; i < 3; i++)
{
    int average = 0;

    for (int j = 0; j < 3; j++)
    {
        average += array[j, i];

    }
    Console.WriteLine($"Cр. арифметическое элементов столбца {i + 1} = {average / 3}");

}